In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Excel_data.xlsx")
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [3]:
# sum the total salary
sal = sum(df['salary']) # this is in python method of finding sum
sal

57801414

In [4]:
# pandas method of finding sum 
print(df.salary.sum())

57801414

In [5]:
print(df.salary.mean())

115602.828

In [6]:
df.salary.min()

30164

In [7]:
df.salary.max()

199529

In [8]:
df.salary.idxmin()

213

In [9]:
df.salary.idxmax()

436

In [10]:
df.salary.median()

117920.0

In [11]:
# Mode: Most frequent data
# Mode works on Categorical data
# continuous data have decimal points eg. age can 20, 55.5 etc
# discrete data has numbers  eg. number of students in class is a definite number like 30,40 etc it cannot be 56.7 this is main difference
# between continuous and discrete data

df.Profession.mode()

0    Chef
Name: Profession, dtype: object

In [12]:
df.Profession.value_counts()

Profession
Chef                 58
Scientist            54
Pilot                53
      Boxer          53
Comedian             52
Software Engineer    51
Doctor               48
Teacher              45
Detective            45
Artist               41
Name: count, dtype: int64

In [13]:
# Variance : spreadness of data
df.salary.var()

2440791463.4653473

In [14]:
# Standard deviation : spreadness of data in context of mean
df.salary.std()

49404.366846113386

In [15]:
# var = (std)^2
# std = sqrt(var)

### Grouping the Data

In [16]:
# we want to group the data based upon subclass (subgroups)
df.groupby('Profession').count()

                   ID  Name  Age  salary
Profession
      Boxer        53    53   53      53
Artist             41    41   38      41
Chef               58    58   58      58
Comedian           52    52   52      52
Detective          45    45   44      45
Doctor             48    48   46      48
Pilot              53    53   52      53
Scientist          54    54   54      54
Software Engineer  51    51   50      51
Teacher            45    45   45      45

In [17]:
# based upon the profession calculating total salary
df.groupby('Profession').salary.sum()

Profession
      Boxer          5506481
Artist               5106581
Chef                 6426784
Comedian             6379828
Detective            5443424
Doctor               5470288
Pilot                5757998
Scientist            6840152
Software Engineer    6013356
Teacher              4856522
Name: salary, dtype: int64

In [18]:
# Multiple aggregation functions together on a set of columns
df[['Age','salary']].agg(['mean','min','max','sum','median','count'])

                 Age        salary
mean       40.810976  1.156028e+05
min        20.000000  3.016400e+04
max        60.000000  1.995290e+05
sum     20079.000000  5.780141e+07
median     40.500000  1.179200e+05
count     492.000000  5.000000e+02

In [19]:
# Applying different aggregation functions for different columns
df.agg({
    'Age' : ['min','max'],
    'salary' : ['mean','count','sum']
})

        Age        salary
min    20.0           NaN
max    60.0           NaN
mean    NaN  1.156028e+05
count   NaN  5.000000e+02
sum     NaN  5.780141e+07

In [20]:
# Multipleaggregation function + groupby()
df.groupby('Profession').agg({
    'Age' : ['min','max'],
    'salary' : ['mean','count','sum']
})

                    Age               salary
                    min   max           mean count      sum
Profession
      Boxer        20.0  58.0  103895.867925    53  5506481
Artist             20.0  60.0  124550.756098    41  5106581
Chef               20.0  60.0  110806.620690    58  6426784
Comedian           20.0  60.0  122689.000000    52  6379828
Detective          20.0  60.0  120964.977778    45  5443424
Doctor             22.0  60.0  113964.333333    48  5470288
Pilot              20.0  60.0  108641.471698    53  5757998
Scientist          22.0  60.0  126669.481481    54  6840152
Software Engineer  21.0  60.0  117908.941176    51  6013356
Teacher            20.0  60.0  107922.711111    45  4856522

In [21]:
# merge(): help us to merge the dataframes based upon common column
df1 = pd.DataFrame({'ID' : [1,2,3], 'Place' : ['Ladakh','Kanyakumari','Coorg']})
df1

   ID        Place
0   1       Ladakh
1   2  Kanyakumari
2   3        Coorg

In [23]:
df2 = pd.DataFrame({'ID' : [2,3,4], 'Best_Time_to_Visit' : ['Rainy','Winter','Winter']})
df2

   ID Best_Time_to_Visit
0   2              Rainy
1   3             Winter
2   4             Winter

In [24]:
merged_df = pd.merge(df1,df2, on = 'ID') # by default merge performs inner merge
merged_df

   ID        Place Best_Time_to_Visit
0   2  Kanyakumari              Rainy
1   3        Coorg             Winter

In [25]:
merged_df = pd.merge(df1, df2, on = 'ID', how = 'inner')
merged_df

   ID        Place Best_Time_to_Visit
0   2  Kanyakumari              Rainy
1   3        Coorg             Winter

In [28]:
# outer merge : Return all the data of right + left table but common data will appear only once
merged_df = pd.merge(df1,df2, on = 'ID', how = 'outer')
merged_df

   ID        Place Best_Time_to_Visit
0   1       Ladakh                NaN
1   2  Kanyakumari              Rainy
2   3        Coorg             Winter
3   4          NaN             Winter

In [30]:
# Left merge : Return all the data of left table but only common record data of right table
merged_df = pd.merge(df1,df2, on = 'ID', how = 'left')
merged_df

   ID        Place Best_Time_to_Visit
0   1       Ladakh                NaN
1   2  Kanyakumari              Rainy
2   3        Coorg             Winter

In [31]:
# Right merge : Return all the data of right table but only common record data of left table
merged_df = pd.merge(df1,df2, on = 'ID' , how = 'right')
merged_df

   ID        Place Best_Time_to_Visit
0   2  Kanyakumari              Rainy
1   3        Coorg             Winter
2   4          NaN             Winter

In [32]:
# join() : join the dataframe, based upon the Index
df1 = pd.DataFrame({'Name' : ['chill','rosy','bunny']}, index = [1,2,3])
df1

    Name
1  chill
2   rosy
3  bunny

In [33]:
df2 = pd.DataFrame({'Networth' : [100, 200, 560]}, index = [2,3,4])
df2

   Networth
2       100
3       200
4       560

In [35]:
# merge function merges based upon common column
# join is based upon common index
# default is left join
joined_df = df1.join(df2)
joined_df

    Name  Networth
1  chill       NaN
2   rosy     100.0
3  bunny     200.0

In [36]:
joined_df = df1.join(df2, how = 'right')
joined_df

    Name  Networth
2   rosy       100
3  bunny       200
4    NaN       560

In [37]:
joined_df = df1.join(df2, how = 'left')
joined_df

    Name  Networth
1  chill       NaN
2   rosy     100.0
3  bunny     200.0

In [38]:
joined_df = df1.join(df2, how = 'outer')
joined_df

    Name  Networth
1  chill       NaN
2   rosy     100.0
3  bunny     200.0
4    NaN     560.0

In [39]:
joined_df = df1.join(df2, how = 'inner')
joined_df

    Name  Networth
2   rosy       100
3  bunny       200

In [43]:
# Concat() : combine the DataFrame (vertically (row) or horizontally(column))
df1 = pd.DataFrame({'ID' : [1,2], 'cars' : ['Dezire','Toyota']})
df2 = pd.DataFrame({'ID' : [3,4], 'cars' : ['Farari', 'Thar']})
df1

   ID    cars
0   1  Dezire
1   2  Toyota

In [44]:
df2

   ID    cars
0   3  Farari
1   4    Thar

In [46]:
concat_df = pd.concat([df1,df2], axis = 0, ignore_index = True)
concat_df

   ID    cars
0   1  Dezire
1   2  Toyota
2   3  Farari
3   4    Thar

In [48]:
concat_df = pd.concat([df1,df2], axis = 0)
concat_df

   ID    cars
0   1  Dezire
1   2  Toyota
0   3  Farari
1   4    Thar

In [49]:
concat_df = pd.concat([df1,df2], axis = 1)
concat_df

   ID    cars  ID    cars
0   1  Dezire   3  Farari
1   2  Toyota   4    Thar

In [50]:
concat_df = pd.concat([df1, df2], axis = 1, ignore_index = True)
concat_df

   0       1  2       3
0  1  Dezire  3  Farari
1  2  Toyota  4    Thar

In [52]:
concat_df = concat_df.rename(columns = {0 : 'ID1', 1 : 'cars1', 2 : 'ID2', 3 : 'cars2'})
concat_df

   ID1   cars1  ID2   cars2
0    1  Dezire    3  Farari
1    2  Toyota    4    Thar